mlsorensen/Apollo2/src/platform_esp32/display.cpp
#include "platform_esp32/display.h"

#include <Arduino.h>
#include <Arduino_GFX_Library.h>
#include <esp_heap_caps.h>
#include <lvgl.h>

#include "core/system.h"
#include "platform_esp32/board_config.h"
#if defined(BOARD_DISPLAY_DSI)
#include <cstring>

#include <esp_async_memcpy.h>
#include <esp_cache.h>
#include <esp_log.h>
#include <esp_lcd_mipi_dsi.h>
#include <esp_lcd_panel_io.h>
#include <esp_lcd_panel_ops.h>
#include <esp_ldo_regulator.h>
#include <freertos/FreeRTOS.h>
#include <freertos/semphr.h>
#endif
#if defined(BOARD_HAS_IO_EXTENSION)
#include <Wire.h>

#include "platform_esp32/io_extension.h"
#endif
#if defined(BOARD_DISPLAY_RGB)
#include <esp_idf_version.h>
#include <esp_lcd_panel_interface.h>
#include <esp_lcd_panel_ops.h>
#include <esp_lcd_panel_rgb.h>
#include <esp_memory_utils.h>
#include <freertos/FreeRTOS.h>
#include <freertos/semphr.h>
#include <freertos/task.h>
#include <sdkconfig.h>
#endif

// A single panel exists per device, and LVGL's flush callback is a plain
// function pointer, so the Arduino_GFX objects live here at file scope rather
// than as members. Display just orchestrates their setup. The panel backend
// (SPI ST7789 vs RGB parallel vs MIPI-DSI) is selected by the board's feature
// macros.
namespace {

Arduino_GFX* g_gfx = nullptr;
lv_color_t* g_draw_buf = nullptr;

#if defined(BOARD_DISPLAY_RGB)
// esp_lcd handle of the RGB panel, needed for esp_lcd_rgb_panel_restart()
// (see Display::rgb_resync). Arduino_ESP32RGBPanel keeps it private with no
// accessor, so we lift it out via explicit template instantiation, which is
// exempt from member access control ([temp.explicit]) — legal C++, no library
// patch, breaks loudly at compile time if the field is ever renamed.
esp_lcd_panel_handle_t g_rgb_panel = nullptr;

using RgbHandleMember = esp_lcd_panel_handle_t Arduino_ESP32RGBPanel::*;
RgbHandleMember rgb_handle_member();  // defined by the friend injection below
template <RgbHandleMember M>
struct RgbHandleRobber {
  friend RgbHandleMember rgb_handle_member() { return M; }
};
template struct RgbHandleRobber<&Arduino_ESP32RGBPanel::_panel_handle>;

// VSYNC-aligned resync. Calling esp_lcd_panel_init() straight from task
// context restarts the pipeline mid-scanline: visibly (truncated frame) and
// dangerously — a bounce-DMA interrupt already pending at that instant can
// refill a buffer after the counters were zeroed, creating the very latch
// we're healing (both observed on the 4.3C, 2026-07-25). The driver's own
// restart runs only inside vertical blanking for the same reason. So:
// rgb_resync() just arms a flag; the on_vsync ISR wakes a high-priority task
// that runs the re-init immediately — inside blanking, when the bounce DMA
// is quiescent and the panel is between frames.
SemaphoreHandle_t g_resync_sem = nullptr;
volatile bool g_resync_armed = false;
volatile bool g_resync_verbose = false;
// Outcome of the last re-init, logged from loop() (Display::rgb_poll):
// the 1536-byte resync task cannot afford a printf. -1 = nothing pending.
volatile int g_resync_result = -1;
volatile bool g_resync_result_verbose = false;

// --- Bounce-buffer bookkeeping: the ghost-raster fix ---
// The IDF RGB driver refills its two bounce buffers from a DMA end-of-buffer
// ISR and picks WHICH buffer to refill as `bb_eof_count % 2` — a software
// counter advanced once per ISR call. Two buffers finishing before the ISR
// runs (any core-1 interrupt latency > one bounce period, ~585 us here; a
// flash write with the cache off is the obvious source) collapse into ONE
// call, so the counter's parity flips and every later refill lands in the
// buffer the panel is scanning. In this build (CONFIG_LCD_RGB_RESTART_IN_VSYNC)
// nothing ever resets that counter — not the per-VSYNC restart, not
// esp_lcd_panel_init — so the flip latches. THIS is the "every 10th line
// flickers, frame ~10 px high, bottom wraps to the top" ghost the S3 RGB
// boards have shown since day one (10 lines = kRgbBouncePx; HW-confirmed
// 2026-09-10, see rgb_vsync_cb). Same code on IDF master; worth reporting.
//
// The counter is private to the driver, so this mirrors the prefix of its
// esp_rgb_panel_t (IDF v5.5.4 components/esp_lcd/rgb/esp_lcd_panel_rgb.c,
// S3 layout incl. dma_restart_link) up to the fields we touch, and refuses
// to arm unless every checkable field agrees with what we configured. On a
// platform bump: diff the struct against the new driver source, then move
// the version check. Deterministic repro for re-verifying: GET
// /coredump?erase=1 (multi-sector flash erase with the cache off).
// Layout + bug verified identical on the v5.5.4 and v5.5.5 tags (2026-09-10);
// the runtime validation in rgb_bounce_fix_arm() is the real safety net.
#if ESP_IDF_VERSION_MAJOR == 5 && ESP_IDF_VERSION_MINOR == 5 && CONFIG_IDF_TARGET_ESP32S3
#define RGB_BOUNCE_PARITY_FIX 1
struct RgbPanelMirror {
  esp_lcd_panel_t base;
  int panel_id;
  void* hal_dev;  // lcd_hal_context_t = one pointer
  size_t data_width;
  size_t fb_bits_per_pixel;
  size_t num_fbs;
  size_t output_bits_per_pixel;
  size_t dma_burst_size;
  void* intr;
  void* pm_lock;
  size_t num_dma_nodes;
  void* dma_chan;
  void* dma_fb_links[3];   // RGB_LCD_PANEL_MAX_FB_NUM
  void* dma_bb_link;
  void* dma_restart_link;  // RGB_LCD_NEEDS_SEPARATE_RESTART_LINK (S3)
  uint8_t* fbs[3];
  uint8_t* bounce_buffer[2];
  size_t fb_size;
  size_t bb_size;
  uint8_t cur_fb_index;
  uint8_t bb_fb_index;
  size_t int_mem_align;
  size_t ext_mem_align;
  int hsync_gpio_num, vsync_gpio_num, de_gpio_num, pclk_gpio_num, disp_gpio_num;
  int data_gpio_nums[16];  // SOC_LCDCAM_RGB_DATA_WIDTH
  uint64_t gpio_reserve_mask;
  uint32_t src_clk_hz;
  esp_lcd_rgb_timing_t timings;
  int bounce_pos_px;
  size_t bb_eof_count;
  size_t expect_eof_count;
};
RgbPanelMirror* g_bb_mirror = nullptr;  // null = mirror failed to validate
// Parity flips seen at VSYNC (cumulative) + the parity of the last sample, for
// the one-line log in Display::rgb_poll(). A flip = the driver lost a refill.
volatile uint32_t g_bb_flips = 0;
volatile bool g_bb_last_odd = false;
#endif

