mlsorensen/Apollo2/src/platform_esp32/display.cpp
bool IRAM_ATTR rgb_vsync_cb(esp_lcd_panel_handle_t,
                            const esp_lcd_rgb_panel_event_data_t*, void*) {
#if RGB_BOUNCE_PARITY_FIX
  if (g_bb_mirror != nullptr) {
    // THE FIX (HW-confirmed 2026-09-10: telemetry caught a 47-EOF frame
    // flipping parity ODD at the exact second the ghost appeared, and it
    // stayed ODD every frame after; A/B with this line compiled out, six
    // GET /coredump?erase=1 flash erases: parity latched ODD and the screen
    // stayed ghosted until reboot — with it, every flip healed on the next
    // frame, one visible blip). The driver's per-VSYNC restart, which runs
    // right after this callback in the same ISR, always resumes the DMA at
    // bounce buffer 0 — so the correct counter parity here is ALWAYS even.
    // Force it, exactly as the driver's own non-RESTART_IN_VSYNC branch does
    // (`bb_eof_count = 0` at VSYNC_END). A coalesced EOF now costs one bad
    // frame instead of latching forever.
    const bool odd = (g_bb_mirror->bb_eof_count & 1u) != 0;
    g_bb_mirror->bb_eof_count = 0;
    if (odd != g_bb_last_odd) ++g_bb_flips;
    g_bb_last_odd = odd;
  }
#endif
  if (!g_resync_armed) return false;
  g_resync_armed = false;
  BaseType_t hpw = pdFALSE;
  xSemaphoreGiveFromISR(g_resync_sem, &hpw);
  return hpw == pdTRUE;
}

// Validate the mirror against the panel we configured; arm only on a full
// match so a driver bump can't silently read garbage.
void rgb_bounce_fix_arm() {
#if RGB_BOUNCE_PARITY_FIX
  auto* m = reinterpret_cast<RgbPanelMirror*>(g_rgb_panel);
  void* fb0 = nullptr;
  esp_lcd_rgb_panel_get_frame_buffer(g_rgb_panel, 1, &fb0);
  const size_t fb_bytes =
      static_cast<size_t>(board::kLcdNativeW) * board::kLcdNativeH * 2;
  const size_t bb_bytes = static_cast<size_t>(board::kRgbBouncePx) * 2;
  const bool ok = m->num_fbs == 1 && m->fb_bits_per_pixel == 16 &&
                  m->fb_size == fb_bytes && m->bb_size == bb_bytes &&
                  m->expect_eof_count == fb_bytes / bb_bytes &&
                  m->timings.h_res == static_cast<uint32_t>(board::kLcdNativeW) &&
                  m->timings.v_res == static_cast<uint32_t>(board::kLcdNativeH) &&
                  m->timings.pclk_hz == static_cast<uint32_t>(board::kRgbPclkHz) &&
                  m->fbs[0] == fb0 && fb0 != nullptr &&
                  esp_ptr_internal(m->bounce_buffer[0]) &&
                  esp_ptr_internal(m->bounce_buffer[1]);
  if (ok) {
    g_bb_mirror = m;
    core::logf("RGB: bounce parity fix armed (bb=%u B, %u EOF/frame)\n",
               static_cast<unsigned>(m->bb_size),
               static_cast<unsigned>(m->expect_eof_count));
  } else {
    core::logf("RGB: bounce parity fix DISABLED - mirror mismatch (num_fbs=%u bpp=%u "
               "fb=%u/%u bb=%u/%u eof=%u res=%ux%u pclk=%u)\n",
               static_cast<unsigned>(m->num_fbs),
               static_cast<unsigned>(m->fb_bits_per_pixel),
               static_cast<unsigned>(m->fb_size), static_cast<unsigned>(fb_bytes),
               static_cast<unsigned>(m->bb_size), static_cast<unsigned>(bb_bytes),
               static_cast<unsigned>(m->expect_eof_count),
               static_cast<unsigned>(m->timings.h_res),
               static_cast<unsigned>(m->timings.v_res),
               static_cast<unsigned>(m->timings.pclk_hz));
  }
#else
  core::logf("RGB: bounce parity fix not built (IDF != 5.5.x)\n");
#endif
}

void rgb_resync_task(void*) {
  for (;;) {
    xSemaphoreTake(g_resync_sem, portMAX_DELAY);
    // esp_lcd_panel_init re-runs lcd_rgb_panel_start_transmission: engine
    // stop, DMA+FIFO reset, bounce_pos_px = 0, both bounce buffers refilled,
    // restart. The engine is stopped while this runs, so overshooting the
    // back porch only starts the next frame late — never mid-scanline.
    const esp_err_t err = esp_lcd_panel_init(g_rgb_panel);
    g_resync_result_verbose = g_resync_verbose;
    g_resync_verbose = false;
    g_resync_result = static_cast<int>(err);  // picked up by rgb_poll()
  }
}
#endif

// Number of screen rows LVGL renders per flush in partial mode. Larger = fewer
// bands/flushes per refresh (the flow graph's ~200px plot renders in ~1 band).
// PSRAM on RGB boards, so the size is cheap. (Probe: was 40.)
//
// HISTORY: an INTERNAL 32-line variant (~51KB, ~2.5x render speedup for the
// settings scroll) lived here briefly — and consumed the exact chunk of
// internal heap WiFi needs to start: with it + NimBLE up, free internal RAM
// bottomed at ~9KB and esp_wifi_init died with ESP_ERR_NO_MEM on every
// attempt. Reverted by choice (working WiFi over scroll fps). Don't bring it
// back while WiFi + BLE are expected to coexist; the running graphs never
// needed it (scope sweep / shot plot invalidate a few columns per frame, so
// their PSRAM blend cost is negligible).
constexpr int kBufferLines = 200;    // PSRAM chunk (RGB/DSI) / SPI chunk

uint32_t tick_cb() { return millis(); }

#if defined(BOARD_DISPLAY_DSI) && defined(BOARD_DSI_PANEL_ST7701)
// ST7701 panel init sequence, transcribed verbatim from Waveshare's BSP
// (esp32_p4_wifi6_touch_lcd_4_3.c, vendor_specific_init_default). Sent over the
// DSI DCS channel by Arduino_DSI_Display before video mode starts. The final
// pair is sleep-out (0x11, 120 ms) + display-on (0x29).
const lcd_init_cmd_t kDsiPanelInit[] = {
    {0xFF, (uint8_t[]){0x77, 0x01, 0x00, 0x00, 0x13}, 5, 0},
    {0xEF, (uint8_t[]){0x08}, 1, 0},
    {0xFF, (uint8_t[]){0x77, 0x01, 0x00, 0x00, 0x10}, 5, 0},
    {0xC0, (uint8_t[]){0x63, 0x00}, 2, 0},
    {0xC1, (uint8_t[]){0x0D, 0x02}, 2, 0},
    {0xC2, (uint8_t[]){0x17, 0x08}, 2, 0},
    {0xCC, (uint8_t[]){0x10}, 1, 0},
    {0xB0, (uint8_t[]){0x40, 0xC9, 0x94, 0x0E, 0x10, 0x05, 0x0B, 0x09, 0x08,
                       0x26, 0x04, 0x52, 0x10, 0x69, 0x6B, 0x69}, 16, 0},
    {0xB1, (uint8_t[]){0x40, 0xD2, 0x98, 0x0C, 0x92, 0x07, 0x09, 0x08, 0x07,
                       0x25, 0x02, 0x0E, 0x0C, 0x6E, 0x78, 0x55}, 16, 0},
    {0xFF, (uint8_t[]){0x77, 0x01, 0x00, 0x00, 0x11}, 5, 0},
    {0xB0, (uint8_t[]){0x5D}, 1, 0},
    {0xB1, (uint8_t[]){0x4E}, 1, 0},
    {0xB2, (uint8_t[]){0x87}, 1, 0},
    {0xB3, (uint8_t[]){0x80}, 1, 0},
    {0xB5, (uint8_t[]){0x4E}, 1, 0},
    {0xB7, (uint8_t[]){0x85}, 1, 0},
    {0xB8, (uint8_t[]){0x21}, 1, 0},
    {0xB9, (uint8_t[]){0x10, 0x1F}, 2, 0},
    {0xBB, (uint8_t[]){0x03}, 1, 0},
    {0xBC, (uint8_t[]){0x00}, 1, 0},
    {0xC1, (uint8_t[]){0x78}, 1, 0},
    {0xC2, (uint8_t[]){0x78}, 1, 0},
    {0xD0, (uint8_t[]){0x88}, 1, 0},
    {0xE0, (uint8_t[]){0x00, 0x3A, 0x02}, 3, 0},
    {0xE1, (uint8_t[]){0x04, 0xA0, 0x00, 0xA0, 0x05, 0xA0, 0x00, 0xA0, 0x00,
                       0x40, 0x40}, 11, 0},
    {0xE2, (uint8_t[]){0x30, 0x00, 0x40, 0x40, 0x32, 0xA0, 0x00, 0xA0, 0x00,
                       0xA0, 0x00, 0xA0, 0x00}, 13, 0},
    {0xE3, (uint8_t[]){0x00, 0x00, 0x33, 0x33}, 4, 0},
    {0xE4, (uint8_t[]){0x44, 0x44}, 2, 0},
    {0xE5, (uint8_t[]){0x09, 0x2E, 0xA0, 0xA0, 0x0B, 0x30, 0xA0, 0xA0, 0x05,
                       0x2A, 0xA0, 0xA0, 0x07, 0x2C, 0xA0, 0xA0}, 16, 0},
    {0xE6, (uint8_t[]){0x00, 0x00, 0x33, 0x33}, 4, 0},
    {0xE7, (uint8_t[]){0x44, 0x44}, 2, 0},
    {0xE8, (uint8_t[]){0x08, 0x2D, 0xA0, 0xA0, 0x0A, 0x2F, 0xA0, 0xA0, 0x04,
                       0x29, 0xA0, 0xA0, 0x06, 0x2B, 0xA0, 0xA0}, 16, 0},
    {0xEB, (uint8_t[]){0x00, 0x00, 0x4E, 0x4E, 0x00, 0x00, 0x00}, 7, 0},
    {0xEC, (uint8_t[]){0x08, 0x01}, 2, 0},
    {0xED, (uint8_t[]){0xB0, 0x2B, 0x98, 0xA4, 0x56, 0x7F, 0xFF, 0xFF, 0xFF,
                       0xFF, 0xF7, 0x65, 0x4A, 0x89, 0xB2, 0x0B}, 16, 0},
    {0xEF, (uint8_t[]){0x08, 0x08, 0x08, 0x45, 0x3F, 0x54}, 6, 0},
    {0xFF, (uint8_t[]){0x77, 0x01, 0x00, 0x00, 0x00}, 5, 0},
    {0x11, (uint8_t[]){0x00}, 0, 120},
    {0x29, (uint8_t[]){0x00}, 0, 0},
};
#elif defined(BOARD_DISPLAY_DSI) && defined(BOARD_DSI_PANEL_HX8394)
// HX8394 panel init (the 5" 720x1280): the esp_lcd_hx8394 driver's sequence,
// flattened. The driver first sends sleep-out + MADCTL 0x00 (RGB order) +
// COLMOD 0x55 (RGB565) + the 2-lane MIPI select (0xBA 0x61), then its vendor
// table (vendor_specific_init_code_default, transcribed verbatim below), which
// itself re-issues sleep-out (200 ms) and ends with display-on (0x29, 80 ms).
const lcd_init_cmd_t kDsiPanelInit[] = {
    {0x11, (uint8_t[]){0x00}, 0, 120},   // SLPOUT
    {0x36, (uint8_t[]){0x00}, 1, 0},     // MADCTL: RGB order
    {0x3A, (uint8_t[]){0x55}, 1, 0},     // COLMOD: RGB565
    {0xBA, (uint8_t[]){0x61}, 1, 0},     // SETMIPI: 2 data lanes
    // --- vendor table ---
    {0xB9, (uint8_t[]){0xFF, 0x83, 0x94}, 3, 0},  // SETEXTC: unlock
    {0xB1, (uint8_t[]){0x48, 0x0A, 0x6A, 0x09, 0x33, 0x54, 0x71, 0x71, 0x2E,
                       0x45}, 10, 0},
    {0xBA, (uint8_t[]){0x61, 0x03, 0x68, 0x6B, 0xB2, 0xC0}, 6, 0},
    {0xB2, (uint8_t[]){0x00, 0x80, 0x64, 0x0C, 0x06, 0x2F}, 6, 0},
    {0xB4, (uint8_t[]){0x1C, 0x78, 0x1C, 0x78, 0x1C, 0x78, 0x01, 0x0C, 0x86,
                       0x75, 0x00, 0x3F, 0x1C, 0x78, 0x1C, 0x78, 0x1C, 0x78,
                       0x01, 0x0C, 0x86}, 21, 0},
    {0xD3, (uint8_t[]){0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x08, 0x08, 0x32,
                       0x10, 0x05, 0x00, 0x05, 0x32, 0x13, 0xC1, 0x00, 0x01,
                       0x32, 0x10, 0x08, 0x00, 0x00, 0x37, 0x03, 0x07, 0x07,
                       0x37, 0x05, 0x05, 0x37, 0x0C, 0x40}, 33, 0},
    {0xD5, (uint8_t[]){0x18, 0x18, 0x18, 0x18, 0x22, 0x23, 0x20, 0x21, 0x04,
                       0x05, 0x06, 0x07, 0x00, 0x01, 0x02, 0x03, 0x18, 0x18,
                       0x18, 0x18, 0x18, 0x18, 0x18, 0x18, 0x18, 0x18, 0x18,
                       0x18, 0x18, 0x18, 0x18, 0x18, 0x18, 0x18, 0x18, 0x18,
                       0x18, 0x18, 0x18, 0x18, 0x19, 0x19, 0x19, 0x19}, 44, 0},
    {0xD6, (uint8_t[]){0x18, 0x18, 0x19, 0x19, 0x21, 0x20, 0x23, 0x22, 0x03,
                       0x02, 0x01, 0x00, 0x07, 0x06, 0x05, 0x04, 0x18, 0x18,
                       0x18, 0x18, 0x18, 0x18, 0x18, 0x18, 0x18, 0x18, 0x18,
                       0x18, 0x18, 0x18, 0x18, 0x18, 0x18, 0x18, 0x18, 0x18,
                       0x18, 0x18, 0x18, 0x18, 0x19, 0x19, 0x18, 0x18}, 44, 0},
    {0xE0, (uint8_t[]){0x07, 0x08, 0x09, 0x0D, 0x10, 0x14, 0x16, 0x13, 0x24,
                       0x36, 0x48, 0x4A, 0x58, 0x6F, 0x76, 0x80, 0x97, 0xA5,
                       0xA8, 0xB5, 0xC6, 0x62, 0x63, 0x68, 0x6F, 0x72, 0x78,
                       0x7F, 0x7F, 0x00, 0x02, 0x08, 0x0D, 0x0C, 0x0E, 0x0F,
                       0x10, 0x24, 0x36, 0x48, 0x4A, 0x58, 0x6F, 0x78, 0x82,
                       0x99, 0xA4, 0xA0, 0xB1, 0xC0, 0x5E, 0x5E, 0x64, 0x6B,
                       0x6C, 0x73, 0x7F, 0x7F}, 58, 0},
    {0xCC, (uint8_t[]){0x0B}, 1, 0},
    {0xC0, (uint8_t[]){0x1F, 0x73}, 2, 0},
    {0xB6, (uint8_t[]){0x6B, 0x6B}, 2, 0},
    {0xD4, (uint8_t[]){0x02}, 1, 0},
    {0xBD, (uint8_t[]){0x01}, 1, 0},
    {0xB1, (uint8_t[]){0x00}, 1, 0},
    {0xBD, (uint8_t[]){0x00}, 1, 0},
    {0xBF, (uint8_t[]){0x40, 0x81, 0x50, 0x00, 0x1A, 0xFC, 0x01}, 7, 0},
    {0x3A, (uint8_t[]){0x50}, 1, 0},
    {0x11, (uint8_t[]){0x00}, 0, 200},
    {0xB2, (uint8_t[]){0x00, 0x80, 0x64, 0x0C, 0x06, 0x2F, 0x00, 0x00, 0x00,
                       0x00, 0xC0, 0x18}, 12, 0},
    {0x29, (uint8_t[]){0x00}, 0, 80},
};
