mlsorensen/Apollo2/src/platform_esp32/display.cpp
    {0x11, (uint8_t[]){0x00}, 1, 120},

    {0x29, (uint8_t[]){0x00}, 1, 20},
};
#elif defined(BOARD_DISPLAY_DSI)
#error "DSI board without a BOARD_DSI_PANEL_* controller macro (see board_config.h)."
#endif

#if defined(BOARD_DISPLAY_DSI)
// --- Double-buffered DPI scan-out ---------------------------------------
// The DPI panel continuously scans a PSRAM framebuffer; blitting LVGL strips
// into the live buffer mid-scan makes moving content (the flow graph) visibly
// blink. So: two driver-owned framebuffers. LVGL stays in PARTIAL mode and we
// rotate each strip into the BACK buffer; when the frame's last strip lands we
// present it (zero-copy scan-out switch, latched by the driver at the next
// frame boundary), wait one refresh event so the old front is off-glass, then
// copy the frame's dirty rows front->back so the back buffer is current again.
// This deliberately avoids LVGL's direct-mode dirty-sync (see the S3 4.3B
// post-mortem below) — the bookkeeping here is ours and total.
esp_lcd_panel_handle_t g_dpi_panel = nullptr;
uint16_t* g_dsi_fb[2] = {nullptr, nullptr};
int g_dsi_back = 1;   // driver scans fb0 after init; we render into fb1 first
// Dirty portrait bounding box of the in-flight frame. Portrait row ==
// landscape x; portrait col == native_w-1 - landscape y. The COLUMN span
// matters as much as the rows: the sync copy below is bounded by this box, and
// on the 5" the scroll graph dirties ~1050 rows but only ~320 of 720 columns —
// full-width row copies (the old scheme) moved 2.2x the pixels the frame
// actually touched (measured 21ms of a 34ms flush).
int g_dirty_r1 = 1 << 30, g_dirty_r2 = -1;
int g_dirty_c1 = 1 << 30, g_dirty_c2 = -1;
SemaphoreHandle_t g_dsi_refresh_sem = nullptr;
// Deferred back-buffer sync: after presenting a frame we do NOT block for the
// scan-out flip. The wait + dirty-row copy happen lazily at the start of the
// NEXT frame — by then the frame boundary has almost always passed, so the
// semaphore take is free and the copy overlaps otherwise-idle time instead of
// sitting in the presented frame's flush path (measured: ~18ms -> ~2ms).
bool g_sync_pending = false;
int g_sync_r1 = 0, g_sync_r2 = -1;   // portrait rows to sync (prev frame's box)
int g_sync_c1 = 0, g_sync_c2 = -1;   // portrait cols of that box

// --- DMA-overlapped dirty sync -------------------------------------------
// The profiled copy (~12ms/frame with the graph running) sat serially inside
// the next frame's flush, yet the measured flip wait was ~0 — the boundary
// passes long before LVGL comes back with strips. So: present ARMS a copy,
// the refresh-done ISR (the flip boundary — the earliest moment the old front
// is off-glass) notifies a small task that starts an AXI-DMA memcpy of the
// dirty rows front->back, and dsi_sync_back_buffer just waits for completion
// — by which time it normally already finished, overlapped with LVGL's render
// of the next frame. esp_async_memcpy handles all cache coherency (source
// writeback, destination invalidation via aligned splits). Full-width rows
// (not the column-bounded box) because DMA needs one contiguous range —
// off the critical path, the extra bytes are free. g_mcp == nullptr (install
// failed / demoted) falls back to the CPU box copy.
async_memcpy_handle_t g_mcp = nullptr;
TaskHandle_t g_dma_task = nullptr;
SemaphoreHandle_t g_dma_done_sem = nullptr;
volatile bool g_dma_armed = false;     // present happened; kick at next boundary
bool g_dma_inflight = false;           // sync must wait on g_dma_done_sem
uint16_t* g_dma_dst = nullptr;
const uint16_t* g_dma_src = nullptr;
size_t g_dma_bytes = 0;

volatile bool g_dma_ok = false;        // last kicked copy actually queued
volatile esp_err_t g_dma_err = ESP_OK; // why the last kick failed (diagnosis)
// Times the big descriptor list wouldn't allocate and the copy fell back to
// small chunks. Not a failure — the frame still goes out over DMA — but it IS
// the DMA-capable heap running short, which is worth seeing before it becomes
// an outright miss.
volatile uint32_t g_dma_degraded = 0;
// Stay on small chunks until this time. Without it the big list is retried on
// EVERY transfer while the pool is short, and each failure costs two
// unrate-limited driver error lines — blocking UART writes on the frame path,
// the same cost that was stalling rendering elsewhere. Retrying every couple of
// seconds is plenty to notice the pool recovering.
uint32_t g_dma_small_until_ms = 0;
constexpr uint32_t kDmaSmallHoldMs = 2000;
SemaphoreHandle_t g_dma_chunk_sem = nullptr;  // per-chunk completion (ISR -> task)

bool dma_chunk_done_cb(async_memcpy_handle_t, async_memcpy_event_t*, void*) {
  BaseType_t woken = pdFALSE;
  xSemaphoreGiveFromISR(g_dma_chunk_sem, &woken);
  return woken == pdTRUE;
}

void dma_copy_task(void*) {
  for (;;) {
    ulTaskNotifyTake(pdTRUE, portMAX_DELAY);  // refresh ISR: boundary passed
    // Chunked kicks: the driver allocates its descriptor list per call from
    // internal DMA heap, ~1/64th of the copy size for TX plus the same for RX
    // — a full-frame dirty box (~1.5MB on the 5") wants ~23KB x2 CONTIGUOUS,
    // which the fragmented runtime heap reliably lacks (measured: largest free
    // block ~31KB mid-scroll -> ESP_ERR_NO_MEM on every full-screen frame,
    // CPU fallback each time).
    //
    // Two sizes, because the right one depends on memory that moves:
    //   128KB (list ~2KB) is the profiled fast path — 12 kicks for a full-screen
    //     box, each with one semaphore round-trip.
    //   32KB (list ~512B) is the fallback. A descriptor list must be
    //     DMA-CAPABLE, and that pool is far tighter than MALLOC_CAP_INTERNAL
    //     suggests: measured 10KB free with the largest block at 1,140 bytes
    //     while WiFi + BLE + a page load were active. A 2KB list cannot fit
    //     there; 512B can.
    // Running 32KB unconditionally cost 21.5 -> 17-19 fps at 85% CPU (45 kicks
    // and 45 task wakeups per frame), so only drop to it when the big list
    // actually fails to allocate, and only for the rest of that transfer — the
    // next frame tries the fast path again. A failed alloc costs microseconds,
    // far less than the CPU copy it avoids.
    // To revert: delete the fallback branch and use kChunkBig alone.
    constexpr size_t kChunkBig = 128 * 1024;
    constexpr size_t kChunkSmall = 32 * 1024;
    // A recent failure means the pool is still short — don't re-prove it every
    // frame (see kDmaSmallHoldMs).
    size_t chunk =
        millis() < g_dma_small_until_ms ? kChunkSmall : kChunkBig;
    xSemaphoreTake(g_dma_chunk_sem, 0);  // drain a stale completion
    const uint8_t* src = reinterpret_cast<const uint8_t*>(g_dma_src);
    uint8_t* dst = reinterpret_cast<uint8_t*>(g_dma_dst);
    size_t left = g_dma_bytes;
    g_dma_err = ESP_OK;
    // Slave the vendor tags to our own cadence, the way shot_store.cpp does for
    // the SD mount retries. A NO_MEM here is the EXPECTED, handled path — we
    // retry smaller and report it in plain language — but the driver ESP_LOGEs
    // twice per failure, which reads like a fault and invites bug reports. Mute
    // them for the copy only; anything failing outside this window (install,
    // another GDMA user) still shouts, and both outcomes of the copy itself are
    // covered by our own messages: "using small DMA chunks" when handled,
    // "DMA sync missed" when not.
    esp_log_level_set("gdma-link", ESP_LOG_NONE);
    esp_log_level_set("async_mcp.gdma", ESP_LOG_NONE);
    while (left > 0) {
      size_t n = left < chunk ? left : chunk;
      g_dma_err = esp_async_memcpy(g_mcp, dst, const_cast<uint8_t*>(src), n,
                                   dma_chunk_done_cb, nullptr);
      if (g_dma_err == ESP_ERR_NO_MEM && chunk > kChunkSmall) {
        // The big descriptor list didn't fit the DMA-capable heap. Shrink for
        // the rest of this transfer and retry this chunk immediately, rather
        // than dropping the whole box to the CPU copy.
        chunk = kChunkSmall;
        ++g_dma_degraded;
        g_dma_small_until_ms = millis() + kDmaSmallHoldMs;
        n = left < chunk ? left : chunk;
        g_dma_err = esp_async_memcpy(g_mcp, dst, const_cast<uint8_t*>(src), n,
                                     dma_chunk_done_cb, nullptr);
      }
      if (g_dma_err != ESP_OK) break;
      if (xSemaphoreTake(g_dma_chunk_sem, pdMS_TO_TICKS(100)) != pdTRUE) {
        g_dma_err = ESP_ERR_TIMEOUT;
        break;
      }
      src += n;
      dst += n;
      left -= n;
    }
    esp_log_level_set("gdma-link", ESP_LOG_ERROR);
    esp_log_level_set("async_mcp.gdma", ESP_LOG_ERROR);
    g_dma_ok = g_dma_err == ESP_OK;
    // Success or failure, unblock the waiter; on failure it sees !g_dma_ok and
    // does the CPU copy itself (a partial chunked copy is harmless — the
    // fallback rewrites the whole box).
    xSemaphoreGive(g_dma_done_sem);
  }
}

