mlsorensen/Apollo2/src/platform_esp32/display.cpp
void dsi_sync_back_buffer() {
  if (!g_sync_pending) return;
  // The DMA-capable heap was too short for the big descriptor list, so the copy
  // ran in small chunks instead. This is the designed behaviour under load, NOT
  // a fault: the frame still goes out over DMA, nothing is dropped, and the
  // only cost is a few more kicks. Worded so a serial log doesn't read as a
  // bug report — the numbers are here to show how much headroom is left.
  // Checked ahead of the success return below, because success is the norm.
  if (g_dma_degraded != 0) {
    static uint32_t last_degraded_ms = 0;
    const uint32_t now_ms = millis();
    if (now_ms - last_degraded_ms >= 1000) {
      core::logf("DSI: using small DMA chunks x%u (expected while WiFi/BLE "
                 "are busy; frames still DMA'd) dma_free=%u dma_largest=%u\n",
                 static_cast<unsigned>(g_dma_degraded),
                 static_cast<unsigned>(heap_caps_get_free_size(
                     MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA)),
                 static_cast<unsigned>(heap_caps_get_largest_free_block(
                     MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA)));
      last_degraded_ms = now_ms;
    }
    g_dma_degraded = 0;
  }
  if (g_dma_inflight) {
    // The DMA copy was kicked at the flip boundary and has been running while
    // LVGL rendered this frame — usually finished by now; wait out the rest
    // (measured ~5ms residual on the 5" with the graph streaming).
    g_dma_inflight = false;
    if (xSemaphoreTake(g_dma_done_sem, pdMS_TO_TICKS(200)) == pdTRUE && g_dma_ok) {
      g_sync_pending = false;
      return;
    }
    // Timeout or queue failure (transient descriptor-alloc no-mem under heap
    // contention): fall through to the CPU copy (correct either way — the
    // front buffer is stable until the next present). Rate-limited diagnosis:
    // the blocking UART write alone costs ms/frame when this fires every frame.
    static uint32_t miss_count = 0, last_report_ms = 0;
    ++miss_count;
    const uint32_t now = millis();
    if (now - last_report_ms >= 1000) {
      // Report the DMA-capable pool too, not just plain internal: a GDMA
      // descriptor list must be DMA-capable, so `largest` alone has repeatedly
      // read a healthy ~31KB while a ~2KB list allocation failed — the wrong
      // pool for this question.
      core::logf(
       "DSI: DMA sync missed x%u — err=%s bytes=%u free=%u largest=%u "
       "dma_free=%u dma_largest=%u\n",
       static_cast<unsigned>(miss_count),
       g_dma_ok ? "TIMEOUT" : esp_err_to_name(g_dma_err),
       static_cast<unsigned>(g_dma_bytes),
       static_cast<unsigned>(heap_caps_get_free_size(MALLOC_CAP_INTERNAL)),
       static_cast<unsigned>(heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL)),
       static_cast<unsigned>(
           heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA)),
       static_cast<unsigned>(
           heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA)));
      last_report_ms = now;
      miss_count = 0;
    }
  }
  // The flip is latched at the frame boundary; make sure one has passed so the
  // buffer we're about to write is genuinely off-glass.
  xSemaphoreTake(g_dsi_refresh_sem, pdMS_TO_TICKS(50));
  // Copy only the previous frame's dirty BOX (rows x cols), not full-width
  // rows: copying a superset of what that frame's strips touched is always
  // correct (the front buffer is a complete consistent frame), and the box is
  // the tight superset we track. Per-row segment copies when the column span
  // is partial; one msync over the whole contiguous span (clean lines in the
  // gaps cost nothing to walk).
  constexpr int fbw = board::kLcdNativeW;
  const int rows = g_sync_r2 - g_sync_r1 + 1;
  const int cols = g_sync_c2 - g_sync_c1 + 1;
  uint16_t* dst0 = g_dsi_fb[g_dsi_back] + static_cast<size_t>(g_sync_r1) * fbw + g_sync_c1;
  const uint16_t* src0 =
      g_dsi_fb[g_dsi_back ^ 1] + static_cast<size_t>(g_sync_r1) * fbw + g_sync_c1;
  if (cols >= fbw) {
    std::memcpy(dst0, src0, static_cast<size_t>(rows) * fbw * sizeof(uint16_t));
  } else {
    const size_t seg = static_cast<size_t>(cols) * sizeof(uint16_t);
    for (int r = 0; r < rows; ++r)
      std::memcpy(dst0 + static_cast<size_t>(r) * fbw, src0 + static_cast<size_t>(r) * fbw, seg);
  }
  esp_cache_msync(dst0,
                  (static_cast<size_t>(rows - 1) * fbw + cols) * sizeof(uint16_t),
                  ESP_CACHE_MSYNC_FLAG_DIR_C2M | ESP_CACHE_MSYNC_FLAG_UNALIGNED);
  g_sync_pending = false;
}

bool dsi_refresh_done_cb(esp_lcd_panel_handle_t, esp_lcd_dpi_panel_event_data_t*,
                         void*) {
  BaseType_t woken = pdFALSE;
  xSemaphoreGiveFromISR(g_dsi_refresh_sem, &woken);
  if (g_dma_armed) {
    // First boundary after a present: the old front is off-glass — start the
    // dirty-sync DMA now so it overlaps the next frame's render.
    g_dma_armed = false;
    BaseType_t w2 = pdFALSE;
    vTaskNotifyGiveFromISR(g_dma_task, &w2);
    woken = static_cast<BaseType_t>(woken | w2);
  }
  return woken == pdTRUE;
}

// LVGL flush for the DSI path. Rotates the landscape strip 90° into the back
// framebuffer using the same mapping as Arduino_GFX rotation=1 (portrait row =
// landscape x; portrait col = native_w-1 - landscape y), so orientation and the
// touch calibration are unchanged.
void dsi_flush_cb(lv_display_t* disp, const lv_area_t* area, uint8_t* px_map) {
  constexpr int fbw = board::kLcdNativeW;  // portrait width  (480)
  constexpr int fbh = board::kLcdNativeH;  // portrait height (800)
  const int w = lv_area_get_width(area);
  const int h = lv_area_get_height(area);
  const uint16_t* src = reinterpret_cast<uint16_t*>(px_map);
  // Before the first write into the back buffer, finish the deferred sync from
  // the previously presented frame (usually free — see dsi_sync_back_buffer).
  dsi_sync_back_buffer();
  uint16_t* fb = g_dsi_fb[g_dsi_back];
  // CACHE-TILED rotate. The naive rotate (outer loop = source rows) writes one
  // 2-byte pixel per framebuffer cache line — consecutive writes land a whole
  // portrait row (fbw*2 bytes) apart, so EVERY pixel write allocates a 64-byte
  // line (read from PSRAM) and later writes 64 bytes back: ~64x memory-traffic
  // amplification, which made this loop ~45ms of the 5"'s ~60ms refresh
  // (measured; the P4's PPA hardware rotate was tried and was NO faster — a
  // 90° rotate's strided access pattern is bandwidth-bound no matter who
  // executes it, so don't re-try PPA here). Rotating in 32x32-pixel tiles
  // makes both the strip reads and the framebuffer writes touch whole 64-byte
  // lines (32 px RGB565 = one line), reducing the traffic ~to the ideal.
  constexpr int kTile = 32;
  for (int ty = 0; ty < h; ty += kTile) {
    const int th = (h - ty < kTile) ? h - ty : kTile;
    for (int tx = 0; tx < w; tx += kTile) {
      const int tw = (w - tx < kTile) ? w - tx : kTile;
      for (int i = 0; i < tw; ++i) {
        // One portrait row per i: contiguous th-pixel run, walked backward
        // (portrait col = fbw-1 - landscape y). Same mapping as the naive
        // loop — equivalence host-verified pixel-exact. (Pairing adjacent
        // columns into 32-bit stores was tried and measured IDENTICAL —
        // this loop is PSRAM-bound, not cycle-bound; don't micro-optimize it.)
        uint16_t* dst = fb + static_cast<size_t>(area->x1 + tx + i) * fbw +
                        (fbw - 1 - (area->y1 + ty));
        const uint16_t* s = src + static_cast<size_t>(ty) * w + tx + i;
        for (int j = 0; j < th; ++j) dst[-j] = s[static_cast<size_t>(j) * w];
      }
    }
  }
  if (area->x1 < g_dirty_r1) g_dirty_r1 = area->x1;
  if (area->x2 > g_dirty_r2) g_dirty_r2 = area->x2;
  if (fbw - 1 - area->y2 < g_dirty_c1) g_dirty_c1 = fbw - 1 - area->y2;
  if (fbw - 1 - area->y1 > g_dirty_c2) g_dirty_c2 = fbw - 1 - area->y1;

