mlsorensen/Apollo2/src/platform_esp32/display.cpp
  esp_lcd_dpi_panel_config_t dpi_cfg = {};
  dpi_cfg.virtual_channel = 0;
  dpi_cfg.dpi_clk_src = MIPI_DSI_DPI_CLK_SRC_DEFAULT;
  dpi_cfg.dpi_clock_freq_mhz = board::kDsiDpiClockHz / 1000000;
  dpi_cfg.pixel_format = LCD_COLOR_PIXEL_FORMAT_RGB565;
  dpi_cfg.num_fbs = 2;  // double buffer: scan one, render into the other
  dpi_cfg.video_timing.h_size = board::kLcdNativeW;
  dpi_cfg.video_timing.v_size = board::kLcdNativeH;
  dpi_cfg.video_timing.hsync_pulse_width = board::kDsiHsyncPulse;
  dpi_cfg.video_timing.hsync_back_porch = board::kDsiHsyncBack;
  dpi_cfg.video_timing.hsync_front_porch = board::kDsiHsyncFront;
  dpi_cfg.video_timing.vsync_pulse_width = board::kDsiVsyncPulse;
  dpi_cfg.video_timing.vsync_back_porch = board::kDsiVsyncBack;
  dpi_cfg.video_timing.vsync_front_porch = board::kDsiVsyncFront;
  dpi_cfg.flags.use_dma2d = true;
  if (esp_lcd_new_panel_dpi(dsi_bus, &dpi_cfg, &g_dpi_panel) != ESP_OK ||
      esp_lcd_panel_init(g_dpi_panel) != ESP_OK) {
    core::logf("DSI: DPI panel create/init FAILED (framebuffer alloc?)\n");
    return false;
  }
  if (esp_lcd_dpi_panel_get_frame_buffer(g_dpi_panel, 2, (void**)&g_dsi_fb[0],
                                         (void**)&g_dsi_fb[1]) != ESP_OK) {
    core::logf("DSI: get framebuffers FAILED\n");
    return false;
  }
  const size_t fb_bytes = static_cast<size_t>(board::kLcdNativeW) *
                          board::kLcdNativeH * sizeof(uint16_t);
  std::memset(g_dsi_fb[0], 0, fb_bytes);
  std::memset(g_dsi_fb[1], 0, fb_bytes);
  esp_cache_msync(g_dsi_fb[0], fb_bytes,
                  ESP_CACHE_MSYNC_FLAG_DIR_C2M | ESP_CACHE_MSYNC_FLAG_UNALIGNED);
  esp_cache_msync(g_dsi_fb[1], fb_bytes,
                  ESP_CACHE_MSYNC_FLAG_DIR_C2M | ESP_CACHE_MSYNC_FLAG_UNALIGNED);

  g_dsi_refresh_sem = xSemaphoreCreateBinary();
  esp_lcd_dpi_panel_event_callbacks_t cbs = {};
  cbs.on_refresh_done = dsi_refresh_done_cb;
  esp_lcd_dpi_panel_register_event_callbacks(g_dpi_panel, &cbs, nullptr);

  // DMA-overlapped dirty sync (see the g_mcp comment block). AXI backend —
  // the P4 GDMA flavor that reaches PSRAM.
  g_dma_done_sem = xSemaphoreCreateBinary();
  g_dma_chunk_sem = xSemaphoreCreateBinary();
  async_memcpy_config_t mcp_cfg = {};
  mcp_cfg.backlog = 4;
  mcp_cfg.dma_burst_size = 64;
  if (esp_async_memcpy_install_gdma_axi(&mcp_cfg, &g_mcp) == ESP_OK &&
      xTaskCreate(dma_copy_task, "dsi_sync", 3072, nullptr, 4, &g_dma_task) == pdPASS) {
    core::logf("DSI: DMA-overlapped dirty sync enabled\n");
    // Baseline level for the vendor tags. dma_copy_task drops them to NONE for
    // the duration of each copy, where a NO_MEM is expected and handled, and
    // restores them to this — so they stay loud for anything that fails outside
    // that window (install, another GDMA user) and silent for the routine
    // small-chunk fallback we report ourselves.
    esp_log_level_set("gdma-link", ESP_LOG_ERROR);
    esp_log_level_set("async_mcp.gdma", ESP_LOG_ERROR);
  } else {
    g_mcp = nullptr;
    core::logf("DSI: async-memcpy unavailable — CPU dirty sync\n");
  }

  core::logf("DSI: panel up %dx%d, double-buffered\n", board::kLcdNativeH,
             board::kLcdNativeW);
  // Backlight after the panel shows black: boost enable high (where a board
  // has one), then PWM full. Polarity is per-board (kBacklightActiveLow): the
  // 4.3's LEDC is inverted (duty 0 = full bright), the 5"'s is normal.
  if (board::kLcdBacklightEn >= 0) {
    pinMode(board::kLcdBacklightEn, OUTPUT);
    digitalWrite(board::kLcdBacklightEn, HIGH);
  }
  ledcAttach(board::kLcdBacklight, 5000, 8);  // 5 kHz, 8-bit PWM backlight
  ledcWrite(board::kLcdBacklight, board::kBacklightActiveLow ? 0 : 255);
#elif defined(BOARD_DISPLAY_RGB)
  // RGB parallel panel (e.g. 7B). The IO-extension I2C must come up first so we
  // can release the panel reset and turn the backlight on.
  Wire.begin(board::kI2cSda, board::kI2cScl);
  Wire.setClock(400000);
  const bool io_ok = io_extension().begin(board::kIoExtAddr);
  core::logf("RGB: IO extension @0x%02X on I2C(SDA=%d,SCL=%d): %s\n",
             board::kIoExtAddr, board::kI2cSda, board::kI2cScl,
             io_ok ? "ACK" : "NO ACK (backlight/reset won't work!)");
  io_extension().set(board::kIoExtLcdReset, false);
  delay(20);
  io_extension().set(board::kIoExtLcdReset, true);  // release reset
  delay(50);
  io_extension().set(board::kIoExtBacklight, true);  // backlight on early

  auto* rgbpanel = new Arduino_ESP32RGBPanel(
      board::kRgbDe, board::kRgbVsync, board::kRgbHsync, board::kRgbPclk,
      board::kRgbR[0], board::kRgbR[1], board::kRgbR[2], board::kRgbR[3], board::kRgbR[4],
      board::kRgbG[0], board::kRgbG[1], board::kRgbG[2], board::kRgbG[3], board::kRgbG[4],
      board::kRgbG[5],
      board::kRgbB[0], board::kRgbB[1], board::kRgbB[2], board::kRgbB[3], board::kRgbB[4],
      /*hsync_polarity=*/0, board::kRgbHsyncFront, board::kRgbHsyncPulse, board::kRgbHsyncBack,
      /*vsync_polarity=*/0, board::kRgbVsyncFront, board::kRgbVsyncPulse, board::kRgbVsyncBack,
      board::kRgbPclkActiveNeg, board::kRgbPclkHz, /*useBigEndian=*/false,
      /*de_idle_high=*/0, /*pclk_idle_high=*/0,
      /*bounce_buffer_size_px=*/board::kRgbBouncePx);
  g_gfx = new Arduino_RGB_Display(board::kLcdNativeW, board::kLcdNativeH, rgbpanel,
                                  board::kLcdRotation, /*auto_flush=*/true);
  if (!g_gfx->begin()) {
    core::logf("RGB: RGB panel begin() FAILED (framebuffer alloc? PSRAM?)\n");
    return false;
  }
  core::logf("RGB: RGB panel up %dx%d\n", g_gfx->width(), g_gfx->height());
  // begin() created the esp_lcd panel (inside getFrameBuffer); grab the handle
  // and stand up the VSYNC-aligned resync machinery (see rgb_resync_task).
  // Priority 10 on core 1 (where the LCD interrupt lives): wakes within a few
  // us of the vsync ISR, well inside the ~470 us back porch. Arduino_GFX
  // registers no RGB event callbacks of its own, so on_vsync is free.
  g_rgb_panel = rgbpanel->*rgb_handle_member();
  g_resync_sem = xSemaphoreCreateBinary();
  // 1536: measured peak 788 (2026-09-10) — for the re-init alone. Nothing
  // else may run in this task: a core::logf from it (the old verbose path)
  // blew the stack canary and panic-rebooted the board (HW, 2026-09-10
  // 16:05:57). The result is logged from loop() instead (rgb_poll).
  xTaskCreatePinnedToCore(rgb_resync_task, "rgb_resync", 1536, nullptr, 10,
                          nullptr, 1);
  const esp_lcd_rgb_panel_event_callbacks_t rgb_cbs = {
      .on_vsync = rgb_vsync_cb,
  };
  esp_lcd_rgb_panel_register_event_callbacks(g_rgb_panel, &rgb_cbs, nullptr);
  rgb_bounce_fix_arm();
  g_gfx->fillScreen(0x0000);
  io_extension().set(board::kIoExtBacklight, true);  // backlight on
#else
  // SPI ST7789 panel (e.g. 2-inch).
  auto* bus = new Arduino_ESP32SPI(board::kLcdDc, board::kLcdCs, board::kLcdSclk,
                                   board::kLcdMosi, board::kLcdMiso, FSPI);
  g_gfx = new Arduino_ST7789(bus, board::kLcdRst, board::kLcdRotation, board::kLcdIps,
                             board::kLcdNativeW, board::kLcdNativeH);
  if (!g_gfx->begin(board::kLcdSpiHz)) return false;
  g_gfx->fillScreen(0x0000);
  ledcAttach(board::kLcdBacklight, 5000, 8);  // 5 kHz, 8-bit PWM backlight
  ledcWrite(board::kLcdBacklight, 255);
#endif

  lv_init();
  lv_tick_set_cb(tick_cb);

#if defined(BOARD_DISPLAY_DSI)
  // Logical (rotated) size: the UI is landscape on a native-portrait panel.
  const int w = board::kLcdNativeH;
  const int h = board::kLcdNativeW;
#else
  const int w = g_gfx->width();
  const int h = g_gfx->height();
#endif
  size_t buf_bytes = static_cast<size_t>(w) * kBufferLines * sizeof(lv_color_t);
#if defined(BOARD_DISPLAY_RGB) || defined(BOARD_DISPLAY_DSI)
  // Draw scratch: prefer a SMALL chunk in INTERNAL RAM. LVGL's software renderer
  // does read-modify-write blending per pixel, and over the PSRAM bus that made
  // full-page redraws (settings scrolls) crawl at ~4fps / 160ms render. A
  // 40-line internal chunk (~64KB on 800px) renders at SRAM speed with more,
  // cheaper chunks. Historical NO_MEM caution: an EARLIER build starved
  // esp_wifi_init with a 200-line internal buffer; 40 lines leaves that
  // headroom. Fallback: the old 200-line PSRAM buffer (slow but always fits).
  //
  // TEARING (why we accept it): the flow graph tears slightly because this is a
  // SINGLE framebuffer. A direct-ESP-IDF esp_lcd double-framebuffer + vsync swap
  // was built and tested on the 4.3B (preserved in a git stash on
  // feat/scale-integration). It works and is genuinely tear-free, BUT this panel
  // has no RAM of its own — the framebuffer lives in PSRAM and the panel scans it
  // continuously. Keeping BOTH framebuffers consistent for the *scrolling* graph
  // forces LVGL to re-render the whole screen every frame (DIRECT mode's cheap
  // partial-sync corrupts on a moving source -> out-of-order frames; FULL mode is
  // correct but full-screen), which on this PSRAM-bound panel is ~5 fps — worse
  // than this single-FB path's ~13 fps with cosmetic tearing. Verdict: not worth
  // it here. Viable tear-free routes if revisited: scroll the graph directly
  // inside both framebuffers (cheap: memmove the strip in each), or use an SPI
  // panel that has its own GRAM and self-refreshes.
  // PSRAM on purpose on the S3 RGB boards — see the kBufferLines comment: the
  // internal variant starved WiFi of its init heap.
  // P4/DSI: the draw buffer lives in PSRAM, ALWAYS. An earlier adaptive gate
  // put it in internal L2MEM when ~128KB headroom remained — that premise
  // ("the radio lives on the remote C6, so internal starvation can't hurt
  // it") proved false on hardware: esp-hosted's SDIO link needs internal
  // DMA RX buffers continuously, and with WiFi + NTP + the SD writer running,
  // a 62KB internal draw buffer drove free internal to ~33KB — the DSI
  // dirty-sync DMA lost its gdma link lists (ESP_ERR_NO_MEM fallback spam)
  // and the radio died outright (assert sdio_rx_get_buffer, boot loop) on
  // the 4.3. The 5" always landed on PSRAM (fragmented at init) at accepted
  // performance; a fixed safe headroom is unknowable as features grow, so
  // the internal path is gone. (The measured internal-buffer perf notes live
  // in git history; if scroll perf ever needs it back, budget internal RAM
  // globally first.)
  g_draw_buf = static_cast<lv_color_t*>(heap_caps_malloc(buf_bytes, MALLOC_CAP_SPIRAM));
  core::logf("RGB: LVGL draw buffer %s (%u bytes)\n",
             g_draw_buf ? "ok" : "FAILED", static_cast<unsigned>(buf_bytes));
#else
  // SPI (2-inch ST7789): PSRAM, like every other board. This used to ask for
  // INTERNAL + DMA memory, on two wrong premises:
  //
  //   1. "SPI pushes this buffer over the bus via DMA." It does not. Arduino_GFX's
  //      ESP32SPI backend is programmed I/O — writePixels() copies pixels word by
  //      word into the SPI peripheral's data_buf FIFO registers with the CPU and
  //      polls for completion. The only DMA-capable allocation it makes is its own
  //      64-byte _buffer (ESP32SPI_MAX_PIXELS_AT_ONCE * 2). Nothing ever DMAs out
  //      of the LVGL draw buffer, so MALLOC_CAP_DMA bought nothing. (The premise
  //      IS true on the original ESP32, whose DMA cannot reach PSRAM at all —
  //      that's where the recipe comes from. The S3's GDMA can.)
  //   2. sizeof(lv_color_t) is the pixel size. It isn't: LVGL 9's lv_color_t is a
  //      3-byte RGB888 struct, but LV_COLOR_DEPTH is 16 and flush_cb hands the
  //      buffer to draw16bitRGBBitmap as uint16_t* — so the buffer is used as
  //      RGB565 and 1/3 of every allocation was never addressed.
  //
  // Together those asked for 192,000 bytes of CONTIGUOUS internal DMA RAM at boot
  // (320 * 200 * 3) on the board that also runs on-chip WiFi + BLE. Internal SRAM
  // is one budget shared by every board's features, and as it grew the largest
  // free block fell under that ask (measured: 180,212 free contiguous vs 192,000
  // needed) — heap_caps_malloc returned null, begin() returned false, and the
  // panel stayed black with "display init failed". No 2-inch code had changed.
  //
  // PSRAM costs nothing measurable here, unlike on the RGB boards: 80 MHz SPI is
  // ~10 MB/s, so shifting a 150KB frame out takes ~15 ms and the bus — not memory
  // bandwidth — is the limit. This panel also has its own GRAM and self-refreshes,
  // so nothing scans PSRAM continuously the way an RGB panel does; the draw buffer
  // has the bus to itself. And it hands 192KB of internal SRAM back to the BLE and
  // WiFi stacks on the tightest board we ship.
  //
  // Internal RAM is now the FALLBACK (half the lines, since it is the scarce one):
  // a failure here degrades to slower rendering instead of no display at all.
  buf_bytes = static_cast<size_t>(w) * kBufferLines * (LV_COLOR_DEPTH / 8);
  g_draw_buf = static_cast<lv_color_t*>(heap_caps_malloc(buf_bytes, MALLOC_CAP_SPIRAM));
  if (g_draw_buf == nullptr) {
    buf_bytes = static_cast<size_t>(w) * (kBufferLines / 2) * (LV_COLOR_DEPTH / 8);
    g_draw_buf = static_cast<lv_color_t*>(heap_caps_malloc(buf_bytes, MALLOC_CAP_INTERNAL));
    core::logf("SPI: no PSRAM for the draw buffer; falling back to internal RAM\n");
  }
  core::logf("SPI: LVGL draw buffer %s (%u bytes, %d lines)\n",
             g_draw_buf ? "ok" : "FAILED", static_cast<unsigned>(buf_bytes),
             static_cast<int>(buf_bytes / (w * (LV_COLOR_DEPTH / 8))));
#endif
  if (g_draw_buf == nullptr) return false;

