mlsorensen/Apollo2/src/platform_esp32/display.cpp
  lv_display_t* disp = lv_display_create(w, h);
#if defined(BOARD_DISPLAY_DSI)
  lv_display_set_flush_cb(disp, dsi_flush_cb);
#else
  lv_display_set_flush_cb(disp, flush_cb);
#endif
  lv_display_set_buffers(disp, g_draw_buf, nullptr, buf_bytes,
                         LV_DISPLAY_RENDER_MODE_PARTIAL);
  return true;
}

#if defined(BOARD_DISPLAY_DSI)
int Display::width() const { return board::kLcdNativeH; }   // landscape UI
int Display::height() const { return board::kLcdNativeW; }
#else
int Display::width() const { return g_gfx ? g_gfx->width() : 0; }
int Display::height() const { return g_gfx ? g_gfx->height() : 0; }
#endif

void Display::set_brightness(int percent) {
  if (percent < 0) percent = 0;
  if (percent > 100) percent = 100;
#if defined(BOARD_DISPLAY_RGB)
  // (DSI boards fall through to the LEDC path below with the SPI boards.)
  // Backlight dim is purely the IO-extension PWM register here. This board's PWM
  // is inverted-duty, so set_pwm writes 255-duty (100% = brightest, 0% = off).
  // The digital backlight enable is already on from begin(), so we don't re-touch
  // it per change (avoids a redundant write fighting the PWM on the same pin).
  io_extension().set_pwm(static_cast<uint8_t>(percent));
#elif defined(BOARD_DISPLAY_DSI)
  // Polarity per board_config: the 4.3's backlight PWM is ACTIVE-LOW (its BSP
  // configures LEDC with output_invert=1; verified on hardware — normal-
  // polarity duty leaves the screen black), the 5"'s is normal.
  const int duty = percent * 255 / 100;
  ledcWrite(board::kLcdBacklight, board::kBacklightActiveLow ? 255 - duty : duty);
#else
  ledcWrite(board::kLcdBacklight, percent * 255 / 100);
#endif
}

bool Display::rgb_resync(bool verbose) {
#if defined(BOARD_DISPLAY_RGB)
  // Full pipeline restart from frame zero (esp_lcd_panel_init), run inside
  // vertical blanking by rgb_resync_task — this only arms it; the work
  // happens at the next VSYNC. Since the bounce-parity fix in rgb_vsync_cb
  // (2026-09-10) the ghost raster heals by itself within a frame, so this
  // is a belt-and-braces escape hatch (Settings "Restart display" + the
  // one-shot at boot). esp_lcd_rgb_panel_restart() is a no-op in this build
  // (CONFIG_LCD_RGB_RESTART_IN_VSYNC ignores need_restart) — don't use it.
  if (g_rgb_panel == nullptr || g_resync_sem == nullptr) return false;
  if (verbose) g_resync_verbose = true;
  g_resync_armed = true;
  return true;
#else
  (void)verbose;
  return false;
#endif
}

void Display::rgb_poll() {
#if defined(BOARD_DISPLAY_RGB)
  // Report the resync task's outcome from here (task context is too small
  // for a printf — see the task's stack comment).
  if (g_resync_result != -1) {
    const int err = g_resync_result;
    g_resync_result = -1;
    if (g_resync_result_verbose || err != ESP_OK) {
      core::logf("RGB: panel re-init resync -> %s\n",
                 esp_err_to_name(static_cast<esp_err_t>(err)));
    }
  }
#endif
#if defined(BOARD_DISPLAY_RGB) && RGB_BOUNCE_PARITY_FIX
  // One line per parity flip the fix absorbed, so the RAM log shows how often
  // the driver loses a refill and what else was going on at that moment.
  static uint32_t seen_flips = 0;
  const uint32_t flips = g_bb_flips;
  if (flips != seen_flips) {
    seen_flips = flips;
    core::logf("RGB: bounce parity flip #%u healed (%s)\n",
               static_cast<unsigned>(flips),
               g_bb_last_odd ? "odd at VSYNC" : "back to even");
  }
#endif
}

}  // namespace platform
